haliwt/Drv8302_mkv46f256vlh16_servo/main.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause  MKV46F256VLH16
 */

/*System includes.*/
#include <stdio.h>
#include "amclib_FP.h"
#include "mlib_FP.h"
#include "gflib_FP.h"
#include "gdflib_FP.h"
#include "gmclib_FP.h"

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"

/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"

#include "fsl_debug_console.h"

#include "fsl_pwm.h"
#include "pin_mux.h"
#include "fsl_xbara.h"
#include "led.h"
#include "key.h"
#include "bldc.h"
#include "adc.h"
#include "pollingusart.h"
#include "output.h"
#include "input.h"
//#include "usart_edma_rb.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define MAX_LOG_LENGTH 20


output_t recoder_number;


static void vTaskUSART(void *pvParameters);
static void vTaskSUBJ(void *pvParameters);
static void vTaskBLDC(void *pvParameters);
static void vTaskCOTL(void *pvParameters);


static void AppTaskCreate (void);
//static void AppObjCreate (void);

/*
**********************************************************************************************************
											变量声明
**********************************************************************************************************
*/
static TaskHandle_t xHandleTaskUSART = NULL;
static TaskHandle_t xHandleTaskSUBJ =  NULL;
static TaskHandle_t xHandleTaskBLDC = NULL;
static TaskHandle_t xHandleTaskCOTL = NULL;

//static QueueHandle_t xQueue1 = NULL;
//static QueueHandle_t xQueue2 = NULL;



typedef struct Msg
{
	uint8_t  ucMessageID;
	uint8_t  usData[10];
	
}MSG_T;

MSG_T   g_tMsg; /* 定义一个结构体用于消息队列 */




/*******************************************************************************
 *
 * Code
 *
 * @brief Main function
 *
******************************************************************************/
int main(void)
{
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();
    
   
    LED_Init();
    KEY_Init();
    DelayInit();
    HALL_Init();
    
    SD315AI_SO12_Input_Init();
    
    HallSensor_GetPinState();
    OUTPUT_Fucntion_Init();
    ADC_CADC_Init();
    ABC_POWER_OUTPUT_Init();
    /* Set the PWM Fault inputs to a low value */
    PWM_BLDC_Init();
    USART_POLLING_Init();
     
    /* 创建任务 */
	AppTaskCreate();
    
    /* 创建任务通信机制 */
//	AppObjCreate();// WT.EDIT log_init(10, MAX_LOG_LENGTH);
    
    vTaskStartScheduler();
    for (;;)
        ;
}

/******************************************************************************************************
*	函 数 名: vTaskTaskUSART
*	功能说明: 接口消息处理。
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 1  (数值越小优先级越低，最低优先级)
********************************************************************************************************/
static void vTaskUSART(void *pvParameters)
{

  uint8_t vTasktx[]="vTaskUSART-1 \r\n";
  // TickType_t xLastWakeTime;
 // const TickType_t xFrequency = 300;
  uint8_t i,ch;
  MSG_T *ptMsg;
 
  const TickType_t xMaxBlockTime = pdMS_TO_TICKS(300); /* 设置最大等待时间为5ms */
  /* 初始化结构体指针 */
	ptMsg = &g_tMsg;
	
	/* 初始化数组 */
	ptMsg->ucMessageID = 0;
    for(i=0;i<4;i++)
        ch =ptMsg->usData[i];

  while(1)
    {
    
      //printf("vTaskUSART-1 \r\n");
       UART_WriteBlocking(DEMO_UART,vTasktx,sizeof(vTasktx)-1);
       UART_ReadBlocking(DEMO_UART, ptMsg->usData, 4);
      
        for(i=0;i<4;i++)
		{
          ch=ptMsg->usData[i];
		  printf("ptMsg->usData[i]= %#x \r\n",ch);

		}
      
        if(ptMsg->usData[0] == 0x01) //'1' = 0x31
         {
           
		      xTaskNotify(xHandleTaskCOTL,      /* 目标任务 */
								ptMsg->usData[2],              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
               printf("Send to xHanderCONT is OK \n");
                for(i=0;i<10;i++)
                 ch =ptMsg->usData[i];
         }
        if(ptMsg->usData[0]== 0x02)
        {
           
	      xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
							ptMsg->usData[2],              /* 发送数据 */
							eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
        }
		//taskYIELD();//vTaskDelay(xMaxBlockTime);
	    vTaskDelay(xMaxBlockTime);// vTaskDelayUntil(&xLastWakeTime, xFrequency);
    }
}
/*********************************************************************************************************
*
*	函 数 名: vTaskSUBJ
*	功能说明: 接收物理按键和数字按键的命令
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 2  
*
*********************************************************************************************************/
static void vTaskSUBJ(void *pvParameters)
{
     
     uint8_t vTasktx1[]="ABC_= 1 @@@@~~~@@@\r\n";
     uint8_t vTasktx2[]="ABC_= 0 ~~~~~~~~~\r\n";
     uint8_t abc_s=0,door_s=0,wipers_s=0;
     uint32_t vlSubj;
     uint32_t ucConKeyValue;
	 BaseType_t xResult;
	const TickType_t xMaxBlockTime = pdMS_TO_TICKS(200); /* 设置最大等待时间为5ms */

	while(1)
    {
          printf("vTaskSUBJ-2 \r\n");
		
		  xResult = xTaskNotifyWait(0x00000000,      
						           0xFFFFFFFF,      
						           &vlSubj,        /* 存储ulNotifiedValue在ulvalue中 */
						           xMaxBlockTime);  /* 最大延迟时间 */
          
		  
		if( xResult == pdPASS )
		{
			
             ucConKeyValue = vlSubj;
             printf("vTaskSUBJ vlSubj = %#x\r\n", ucConKeyValue);
             /*******************ABC_POWER_F*************************/
             #if 1
             if(ucConKeyValue==0x01)
			 {
                 
                  //abc_s ++ ;
                 if(abc_s == 0)
                 {
                   A_POWER_OUTPUT =0;
                   abc_s ++ ;
                  //printf("ABC_= 1 @@@@~~~@@@\r\n");
                  UART_WriteBlocking(DEMO_UART,vTasktx1,sizeof(vTasktx1)-1);
		     
			     }
			     else 
                 {
                   abc_s = 0;
                   A_POWER_OUTPUT =1;
                  
