haliwt/Drv8302_mkv46f256vlh16_servo/main.c
        	HALLSensor_Detected_BLDC(uwStep,pwm_f,dirvalue); 
           

        }
	
      taskYIELD();// // vTaskDelayUntil(&xLastWakeTime, xFrequency); // vTaskDelay(xMaxBlockTime);         
      }
 } 

/*********************************************************************************************************
*
*	函 数 名: vTaskCOTL
*	功能说明: 接收物理按键和数字按键的命令
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 4  
*
*********************************************************************************************************/
static void vTaskCOTL(void *pvParameters)
{
   
     uint8_t vTaskCotltx[]= "vTaskCOTL-4";
     uint8_t ucKeyCode=0,abc_s=0,digital_s=0;
     uint8_t start_s =0,door_s = 0,wiper_s=0,air_s=0;
     uint8_t hall_s = 0,wheel_s=0,abc_power_s=0;
     
     TickType_t xLastWakeTime;

    const TickType_t xFrequency = 200;
    xLastWakeTime = xTaskGetTickCount();
    BaseType_t xResult;
	const TickType_t xMaxBlockTime = pdMS_TO_TICKS(100); /* 设置最大等待时间为5ms */
	uint8_t ucControl=0;
	uint32_t rlValue,ulValue;
	

	while(1)
    {
	       //printf("vTaskCOTL-4 \r\n");
          
            UART_WriteBlocking(DEMO_UART,vTaskCotltx,sizeof(vTaskCotltx)-1);
          
          
		   ucKeyCode = KEY_Scan(0);
           /*Check U phase*/
           if(GPIO_PinRead(SD315AI_SO1_A_GPIO,SD315AI_SO1_A_PIN)==1 ||GPIO_PinRead(SD315AI_SO2_A_GPIO,SD315AI_SO1_A_PIN)==1)
          {
               GPIO_PinWrite(SD315AI_VL_A_GPIO,SD315AI_VL_A_PIN,1);//SD315_VL_A_OUTPUT=0;
           
          }
          else
          {
              GPIO_PinWrite(SD315AI_VL_A_GPIO,SD315AI_VL_A_PIN,0);//SD315_VL_A_OUTPUT=0;

          }
          /*Check V phase*/
          if(GPIO_PinRead(SD315AI_SO1_B_GPIO,SD315AI_SO1_B_PIN)== 1 ||GPIO_PinRead(SD315AI_SO2_B_GPIO,SD315AI_SO2_B_PIN)== 1)
          {
               
               GPIO_PinWrite(SD315AI_VL_B_GPIO,SD315AI_VL_B_PIN,1);//SD315_VL_B_OUTPUT=0;
            

          }
          else
          {
               GPIO_PinWrite(SD315AI_VL_B_GPIO,SD315AI_VL_B_PIN,0);//SD315_VL_B_OUTPUT=0;
          }
          /*Check W phase*/
          if(GPIO_PinRead(SD315AI_SO1_C_GPIO,SD315AI_SO1_C_PIN)== 1 || GPIO_PinRead(SD315AI_SO2_C_GPIO,SD315AI_SO2_C_PIN)== 1)
          {
                GPIO_PinWrite(SD315AI_VL_C_GPIO,SD315AI_VL_C_PIN,1);
               
          }
          else
          {
                GPIO_PinWrite(SD315AI_VL_C_GPIO,SD315AI_VL_C_PIN,0);
          }
		  xResult = xTaskNotifyWait(0x00000000,      
						            0xFFFFFFFF,      
						            &rlValue,        /* 存储ulNotifiedValue在ulvalue中 */
						            xMaxBlockTime);  /* 最大延迟时间 */
		
		if( xResult == pdPASS )
		{
            ulValue=rlValue;
			printf("vTaskCOTL = %#x\r\n", ulValue);
			/****************digitalkey coder******************/
			 if(ulValue == 0x01)
			 {
                ucKeyCode =ABC_POWER_PRES  ; 
			 }
			 if(ulValue == 0x2)
			 {
                ucKeyCode =START_PRES  ; 
			 }
			 if(ulValue == 0x4)
			 {
                ucKeyCode =DIR_PRES  ; 
			 }
			 if(ulValue == 0x07)
			 {
                ucKeyCode =DIGITAL_ADD_PRES  ; 
			 }
			 if(ulValue == 0x06)
			 {
                ucKeyCode =DIGITAL_REDUCE_PRES  ; 
			 }
			 if(ulValue == 0x09)
			 {
                ucKeyCode =DOOR_PRES ; 
			 }
			 if(ulValue == 0x0a)
			 {
                ucKeyCode =HALL_PRES ; 
			 }
			 if(ulValue == 0x0c)
			 {
                ucKeyCode =WHEEL_PRES ; 
			 }
			  if(ulValue == 0x0e)
			 {
                ucKeyCode =WIPERS_PRES ; 
			 }
			  if(ulValue == 0x12)
			 {
                ucKeyCode =AIR_PRES ; 
			 }
			 
		}
		else
		{
			/* 3?ê± */
			LED1=0;
			LED2 =0 ;
		}

      /*处理接收到的按键功能*/  
		if(ucKeyCode !=KEY_UP) 
				
			{
               switch(ucKeyCode)//if(ptMsg->ucMessageID == 0x32)
                { 
                 
                  case ABC_POWER_PRES :

				  PRINTF("ABC_PRES key \r\n");
				     abc_power_s++;
				  if((abc_power_s ==1)||(recoder_number.break_f==1))
				  	{
                       ucControl = 0x01;
                       abc_s ++;
                       if(abc_s == 255) abc_s =3;
                       if(recoder_number.break_f ==1)
                       {
                            recoder_number.break_f=0;
                            abc_s =2;
                       }
                       xTaskNotify(xHandleTaskSUBJ ,          //xHandleTaskBLDC,        /* 目标任务 */
                                   ucControl,              /* 发送数据 */
                                   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                       printf("ABC POWER IS SEND WORKS \n");
                     }
					else 
					{
                     ucControl = 0x01;
                     abc_power_s =0 ;
                     xTaskNotify( xHandleTaskSUBJ ,//xHandleTaskBLDC,        /* 目标任务 */
                                 ucControl,              /* 发送数据 */
                                 eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                     printf("ABC POWER IS STOP \n");

					}
				  	break;

				 case START_PRES:
                   PRINTF("START_PRES key \r\n");
				    start_s ++;
		          if(((start_s == 1)||(abc_s ==2))&&(abc_s!=0))
		          {
                    
                     ucControl =0xa0;
                     abc_s =5; ;
    				 recoder_number.break_f=0;
    				 xTaskNotify(xHandleTaskBLDC,      /* 目标任务 */
    								ucControl,              /* 发送数据 */
    								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                    printf("START KEY IS SEND WORKS \n");
				  }
				  else 
				  {
                     ucControl = 0xa1;
					 start_s =0;
					  xTaskNotify(xHandleTaskBLDC,      /* 目标任务 */
									ucControl,              /* 发送数据 */
									eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
					 printf("START KEY IS STOP\n");
				  }
                 
				  break;
				  
				 case DIR_PRES: //3

			      recoder_number.dir_change++;
	  			 PRINTF(" DIR_change = %d  \r\n", recoder_number.dir_change);
	  			 if(recoder_number.dir_change == 1)
	   				{
                        LED1 =0;
						LED2 =0;
				    }
				 else 
				   {
                      recoder_number.dir_change =0;
					  
