haliwt/Drv8302_mkv46f256vlh16_servo/main.c
				   }
			
           		break;
				
			 case DIGITAL_ADD_PRES ://4
				PRINTF("DIGITAL_ADD_PRES key \r\n");
                  digital_s ++;
				 if(digital_s ==1)
				  	{
                       ucControl = 0x01;
                       xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
                                   ucControl,              /* 发送数据 */
                                   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                     }
					else 
					{
                     ucControl = 0x00;
                     digital_s =0 ;
                     xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
                           ucControl,              /* 发送数据 */
                           eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */

					}
				break;
				
			 case DIGITAL_REDUCE_PRES ://5 PAT13
			 	PRINTF("DIGITAL_REDUCE_PRES key \r\n");
                digital_s ++;
			     if((digital_s ==1)||(recoder_number.break_f ==1))
				   {
                      recoder_number.break_f =0;
					//  abc_power_s=1;
					  ucControl = 0x05;
					  xTaskNotify(xHandleTaskBLDC,		/* 目标任务 */
								  ucControl,			  /* 发送数据 */
								  eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
					}
				   else 
				   {
                     //abc_power_s=0;
					ucControl = 0x04;
					digital_s =0 ;
					xTaskNotify(xHandleTaskBLDC,	  /* 目标任务 */
						  ucControl,			  /* 发送数据 */
						  eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				   	}
				
				break;
				
			 case DOOR_PRES ://6
			 	   PRINTF("DOOR_PRES key \r\n");
			 	   door_s ++; ;
				   if(door_s ==1)
				   {
                      
                       ucControl = 0x09;
					
					  xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								   ucControl,              /* 发送数据 */
								   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				   }
				   else
				   {
                      door_s =0; 
                     ucControl = 0x08;
					  xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								   ucControl,              /* 发送数据 */
								   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                    }
			 	   
				break;
				   
			 case HALL_PRES://7
			 	PRINTF("HALL_PRES key \r\n");
				  hall_s ++ ;
				   if(hall_s ==1)
				   {
                      
                       ucControl = 0x0b;
					
					  xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								   ucControl,              /* 发送数据 */
								   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				   }
				   else
				   {
            		  hall_s = 0;
					  ucControl = 0x0a;
					  xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								   ucControl,              /* 发送数据 */
								   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                   }
				break;
			 
			 case WHEEL_PRES : //8 PTA5
			    PRINTF("WHEEL_PRES key \r\n");
				  wheel_s ++ ;
				 
			    break;
				
			 case WIPERS_PRES: //9雨刮器
			  	PRINTF("WIPERS_PRES key \r\n");
				wiper_s ++;
				
				if(wiper_s ==1)
				{

                   ucControl = 0x0e;
				   xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
							   ucControl,              /* 发送数据 */
							   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				}
				else if(wiper_s ==2)
				{
                    ucControl = 0x0f;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				 }
				else if(wiper_s == 3)
			    {
					ucControl = 0x10;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				}
				else
				{
                    wiper_s = 0;
					ucControl = 0x11;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				}
             break;
				
	         case AIR_PRES : //10 PE29
	         	PRINTF("AIR_PRES key \r\n");
	            air_s ++;
				        
				if(air_s ==1)
				{
			        ucControl = 0x12;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				}	  
			    else 
			    {
		            air_s =0;
				    ucControl = 0x13;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				  
				   
			    }
                break;
        }
        
	}
      vTaskDelayUntil(&xLastWakeTime, xFrequency);//taskYIELD();//
   }//end whilt(1)
}
/********************************************************************************************************
*	函 数 名: AppTaskCreate
*	功能说明: 创建应用任务
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************/
static void AppTaskCreate (void)
{
    xTaskCreate( vTaskUSART,   									/* 任务函数  */
                 "vTaskUserIF",     							/* 任务名    */
                 configMINIMAL_STACK_SIZE + 166,               	/* 任务栈大小，单位word，也就是4字节 */
                 NULL,              							/* 任务参数  */
                 tskIDLE_PRIORITY+1,                 			/* 任务优先级 最低*/
                 &xHandleTaskUSART );  							/* 任务句柄  */

	xTaskCreate( vTaskSUBJ,    									/* 任务函数  */
                 "vTaskBLDC",  									/* 任务名    */
                 configMINIMAL_STACK_SIZE + 166,         		/* stack大小，单位word，也就是4字节 */
                 NULL,        									/* 任务参数  */
                 tskIDLE_PRIORITY+2,           					/* 任务优先级*/
                 &xHandleTaskSUBJ); 							/* 任务句柄  */
	
	xTaskCreate( vTaskBLDC,    									/* 任务函数  */
                 "vTaskBLDC",  									/* 任务名    */
                 configMINIMAL_STACK_SIZE + 934,         		/* stack大小，单位word，也就是4字节 */
                 NULL,        									/* 任务参数  */
                 tskIDLE_PRIORITY+3,           					/* 任务优先级*/
                 &xHandleTaskBLDC); 							/* 任务句柄  */

	xTaskCreate( vTaskCOTL,    									/* 任务函数  */
                 "vTaskCOTL",  									/* 任务名    */
                 configMINIMAL_STACK_SIZE + 166,         		/* stack大小，单位word，也就是4字节 */
                 NULL,        									/* 任务参数  */
                 tskIDLE_PRIORITY+4,           					/* 任务优先级*/
                 &xHandleTaskCOTL); 							/* 任务句柄  */

